day1/load_testing/logs/sync_sleep_2/puma/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        4    hits
Availability:		      100.00 %
Elapsed time:		       10.01 secs
Data transferred:	        0.00 MB
Response time:		     5040.00 ms
Transaction rate:	        0.40 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        2.01
Successful transactions:        4
Failed transactions:	        0
Longest transaction:	     8050.00 ms
Shortest transaction:	        0.00 ms
 
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        0    hits
Availability:		        0.00 %
Elapsed time:		       10.97 secs
Data transferred:	        0.00 MB
Response time:		        0.00 ms
Transaction rate:	        0.00 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        0.00
Successful transactions:        0
Failed transactions:	        0
Longest transaction:	        0.00 ms
Shortest transaction:	        0.00 ms
 
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        0    hits
Availability:		        0.00 %
Elapsed time:		       10.97 secs
Data transferred:	        0.00 MB
Response time:		        0.00 ms
Transaction rate:	        0.00 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        0.00
Successful transactions:        0
Failed transactions:	        0
Longest transaction:	        0.00 ms
Shortest transaction:	        0.00 ms